{
  "adversity": [
    "Describe a specific situation recently where things didn't go your way.",
    "What is a recent challenge or problem you had to deal with?",
    "Describe a moment from your day that felt difficult.",
    "What is a specific event that bothered you recently?",
    "Describe a conversation or event that didn't go as planned.",
    "What is a situation you faced recently that was frustrating?",
    "Think of a recent obstacle you encountered. What happened?"
  ],
  "belief": [
    "In that exact moment, what was the first thing you told yourself?",
    "When that happened, what reason did you give yourself for why it occurred?",
    "At that time, what did you assume this situation meant about you?",
    "What was the immediate story you told yourself when things went wrong?",
    "In the heat of the moment, whom or what did you blame?",
    "What did you think this situation meant for your future?",
    "If you could hear your thoughts at that moment, what were they saying?"
  ],
  "consequence": [
    "Because you thought that, how did you react?",
    "How did that specific thought make your body feel at the time?",
    "What did thinking that make you want to do (or stop doing)?",
    "Did that thought make you want to fix the problem or hide from it?",
    "How did your mood change immediately after you had that thought?",
    "What actions did you take because you were viewing the situation that way?",
    "How did thinking that way affect your energy for the rest of the day?"
  ],
  "dispute": {
    "evidence": [
      "If you look only at the facts, what actually happened?",
      "What is one piece of evidence that suggests your initial thought wasn't 100% true?",
      "If a camera had recorded the event, what would it show that is different from your story?",
      "What are the plain facts, separate from your opinion about what happened?",
      "Is there any proof that the situation isn't as permanent as it felt?",
      "What specific details contradict the story you told yourself?"
    ],
    "alternatives": [
      "What is another possible reason this happened?",
      "How would a supportive friend explain why this occurred?",
      "What factors completely outside your control might have contributed to this?",
      "Could this have simply been bad timing or bad luck? How so?",
      "What is a less personal explanation for what went wrong?",
      "Is there a simpler, less dramatic explanation for this event?"
    ],
    "usefulness": [
      "How does seeing it this new way change how you feel?",
      "What does this new perspective free you to do next?",
      "If you accept this new explanation, how does your mood shift?",
      "What becomes possible if you move forward with this new understanding?",
      "How does focusing on this alternative view help you handle the situation?",
      "What is the most helpful step you can take now that you see it differently?"
    ]
  },
  "energy": [
    "How would you describe your mood right now compared to when you started?",
    "What is one small, positive step you feel ready to take?",
    "What mental weight feels like it has been lifted?",
    "How do you feel about the situation now that you have looked at it closely?",
    "What are you willing to try next?",
    "Describe your current mindset in one word."
  ]
}