{
  "adversity": [
    "What specific event happened today that bothered you?",
    "What details about today didn't go the way you expected?",
    "What specifically happened that left you feeling upset or tense?",
    "What specific words or actions stuck with you in a bad way?",
    "What was the exact situation that made you feel stressed, sad, or angry?",
    "What change or decision was the hardest part of your day to handle?",
    "What specific message, comment, or action felt hurtful?",
    "What was the single most difficult moment of your day?"
  ],
  "belief": [
    "In that moment, what did you immediately tell yourself?",
    "What meaning have you assigned to this event?",
    "What bad outcome did you predict would happen next?",
    "What did you assume caused this to happen?",
    "What story are you telling yourself about why this occurred?",
    "What are you telling yourself this situation implies about your future?",
    "If you had to sum up your thought in one sentence, what would it be?",
    "What was the very first thought you had about yourself when it happened?",
    "What judgment have you made about the situation?",
    "What are you telling yourself this means about who you are?"
  ],
  "consequence": [
    "Because you had that thought, how did your behavior change?",
    "In what ways did thinking that affect your body physically?",
    "How is thinking this way impacting your current goals?",
    "Right after you had that thought, what specific emotions came up?",
    "How did that specific thought influence how you treated yourself or others?",
    "What tasks or actions did you avoid because of that thought?",
    "In what way did that thought alter your energy levels?",
    "How would you describe the shift in your mood immediately after thinking that?",
    "How did thinking that influence your desire to keep trying?"
  ],
  "dispute": {
    "evidence": [
      "What specific facts suggest your thought might be exaggerated?",
      "What separates the proven facts of this situation from your assumptions?",
      "What positive details might you be overlooking in this situation?",
      "If you had to prove this thought in court, what evidence would actually hold up?",
      "What concrete evidence exists that supports the opposite view?",
      "How would a video recording of the event differ from the story in your head?",
      "Which parts of this are you 100% sure about, and which parts are guesses?",
      "When in the past have you seen the opposite of this to be true?",
      "How would a neutral observer describe this differently than you did?",
      "What are three facts that contradict your negative thought?"
    ],
    "alternatives": [
      "What is one reason this happened that is completely outside of your control?",
      "What aspects of this situation are temporary rather than permanent?",
      "What is a simpler, less dramatic explanation for why this occurred?",
      "How would you explain this situation to a friend to make them feel better?",
      "What specific circumstances (like timing, stress, or bad luck) contributed to this?",
      "How would a totally unbiased person explain what happened?",
      "If you were feeling confident right now, how would you interpret this differently?",
      "What is a kinder, more forgiving way to describe what happened?",
      "What other factors contributed to this outcome besides you?",
      "What is a 'Non-Catastrophic' way to look at this?"
    ],
    "usefulness": [
      "If you keep thinking this way, what will it cost you?",
      "How is holding onto this thought serving or hindering you right now?",
      "What would be a more useful thought to focus on to solve the problem?",
      "If you let this thought go, what would you be free to do?",
      "In what way is this thought affecting your progress toward your goals?",
      "What is the actual utility of blaming yourself in this specific instance?",
      "How does focusing on this thought affect your energy levels?"
    ]
  },
  "energy": [
    "Now that you've looked at the evidence, how would you describe your emotion 0-10?",
    "What is one small step you feel ready to take right now?",
    "What new thought feels the most accurate and helpful to you?",
    "What tiny commitment can you make for the next hour?",
    "If the old negative thought comes back, what will you say to it?",
    "How does your body feel different now compared to when you started?",
    "What looks different about the situation now that you've analyzed it?",
    "What seems possible now that didn't seem possible a few minutes ago?",
    "How would you describe your current mood in one word?",
    "What mental weight feels like it has been lifted?",
    "What are you willing to try now?"
  ]
}