{
   "adversity": [
      "Describe a specific personal challenge you faced recently.",
      "What is a recent event that didn't go as planned?",
      "Describe a situation where you encountered a personal obstacle.",
      "What specific event triggered a negative reaction in you?",
      "Describe a recent conflict or problem you faced."
   ],
   "belief": [
      "What was the very first thought that crossed your mind?",
      "How did you explain the cause of this event to yourself?",
      "At that moment, what did you assume this situation meant about you?",
      "What immediate story did you tell yourself about why this happened?",
      "In that moment, whom or what did you hold responsible?",
      "What did you predict would be the result of this situation?",
      "If you could play back your internal thoughts, what were they saying?"
   ],
   "consequence": [
      "As a result of that thought, what specific emotion did you feel?",
      "How did that belief physically feel in your body?",
      "What did thinking that make you want to do immediately?",
      "How did that perspective affect your willingness to face the situation?",
      "How did your mood shift the moment you accepted that thought?",
      "What action did you take because you were viewing it that way?",
      "How did holding that belief affect your energy for the rest of the day?"
   ],
   "dispute": {
      "evidence": [
         "If you looked at this situation like a neutral detective, what extra details would you capture?",
         "What specific details suggest the situation isn't as extreme as it felt in the moment?",
         "What facts might be missing from that initial quick judgment?",
         "If a camera recorded this, what would it show that softens your initial version of the story?",
         "What specific details might a supportive friend point out that you missed?",
         "What are the plain facts that don't fit into your first impression?"
      ],
      "alternatives": [
         "Looking at these facts, what is a completely different explanation for what happened?",
         "What factors completely outside of your control might have contributed to this outcome?",
         "In what ways could this be a case of bad timing or circumstances?",
         "What is a less personal explanation for why this happened?",
         "What specific circumstances make this a problem for 'right now' rather than 'forever'?"
      ],
      "usefulness": [
         "Comparing your old and new explanations, what is the specific downside of staying with the old one?",
         "How does the new explanation change your readiness to act compared to the old one?",
         "In what specific way does the new perspective serve your goals better than the old one?",
         "What acts of self-care or problem-solving become possible with the new view that weren't possible before?",
         "How does your mindset shift when you replace the old thought with the new one?",
         "What specific difference does the new explanation make for your energy or peace of mind?"
      ]
   },
   "energy": [
      "How would you describe your mood right now compared to when you started this exercise?",
      "What is one small, positive step you feel ready to take based on this new perspective?",
      "What shift do you notice in your physical tension or mental weight?",
      "How do you view the situation differently now that you have challenged your first thought?",
      "What specific action are you willing to try next?",
      "How would you characterize your current mindset as you move forward?"
   ]
}
